brandonbraun653/STM32HAL_H7/stm32h7/Device/conf/stm32h7xx_hal_conf.h
/* ########################### Ethernet Configuration ######################### */
#define ETH_TX_DESC_CNT         4  /* number of Ethernet Tx DMA descriptors */
#define ETH_RX_DESC_CNT         4  /* number of Ethernet Rx DMA descriptors */

#define ETH_MAC_ADDR0    ((uint8_t)0x02)
#define ETH_MAC_ADDR1    ((uint8_t)0x00)
#define ETH_MAC_ADDR2    ((uint8_t)0x00)
#define ETH_MAC_ADDR3    ((uint8_t)0x00)
#define ETH_MAC_ADDR4    ((uint8_t)0x00)
#define ETH_MAC_ADDR5    ((uint8_t)0x00)

/* ########################## Assert Selection ############################## */
/**
  * @brief Uncomment the line below to expanse the "assert_param" macro in the
  *        HAL drivers code
  */
/* #define USE_FULL_ASSERT    1 */


/* Includes ------------------------------------------------------------------*/
/**
  * @brief Include module's header file
  */

#ifdef HAL_RCC_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_rcc.h>
#endif /* HAL_RCC_MODULE_ENABLED */

#ifdef HAL_GPIO_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_gpio.h>
#endif /* HAL_GPIO_MODULE_ENABLED */

#ifdef HAL_DMA_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_dma.h>
#endif /* HAL_DMA_MODULE_ENABLED */

#ifdef HAL_MDMA_MODULE_ENABLED
 #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_mdma.h>
#endif /* HAL_MDMA_MODULE_ENABLED */

#ifdef HAL_HASH_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_hash.h>
#endif /* HAL_HASH_MODULE_ENABLED */

#ifdef HAL_DCMI_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_dcmi.h>
#endif /* HAL_DCMI_MODULE_ENABLED */

#ifdef HAL_DMA2D_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_dma2d.h>
#endif /* HAL_DMA2D_MODULE_ENABLED */

#ifdef HAL_DSI_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_dsi.h>
#endif /* HAL_DSI_MODULE_ENABLED */

#ifdef HAL_DFSDM_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_dfsdm.h>
#endif /* HAL_DFSDM_MODULE_ENABLED */

#ifdef HAL_ETH_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_eth.h>
#endif /* HAL_ETH_MODULE_ENABLED */

#ifdef HAL_EXTI_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_exti.h>
#endif /* HAL_EXTI_MODULE_ENABLED */

#ifdef HAL_CORTEX_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_cortex.h>
#endif /* HAL_CORTEX_MODULE_ENABLED */

#ifdef HAL_ADC_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_adc.h>
#endif /* HAL_ADC_MODULE_ENABLED */

#ifdef HAL_FDCAN_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_fdcan.h>
#endif /* HAL_FDCAN_MODULE_ENABLED */

#ifdef HAL_CEC_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_cec.h>
#endif /* HAL_CEC_MODULE_ENABLED */

#ifdef HAL_COMP_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_comp.h>
#endif /* HAL_COMP_MODULE_ENABLED */

#ifdef HAL_CRC_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_crc.h>
#endif /* HAL_CRC_MODULE_ENABLED */

#ifdef HAL_CRYP_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_cryp.h>
#endif /* HAL_CRYP_MODULE_ENABLED */

#ifdef HAL_DAC_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_dac.h>
#endif /* HAL_DAC_MODULE_ENABLED */

#ifdef HAL_FLASH_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_flash.h>
#endif /* HAL_FLASH_MODULE_ENABLED */

#ifdef HAL_HRTIM_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_hrtim.h>
#endif /* HAL_HRTIM_MODULE_ENABLED */

#ifdef HAL_HSEM_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_hsem.h>
#endif /* HAL_HSEM_MODULE_ENABLED */

#ifdef HAL_SRAM_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_sram.h>
#endif /* HAL_SRAM_MODULE_ENABLED */

#ifdef HAL_NOR_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_nor.h>
#endif /* HAL_NOR_MODULE_ENABLED */

#ifdef HAL_NAND_MODULE_ENABLED
  #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_nand.h>
#endif /* HAL_NAND_MODULE_ENABLED */

#ifdef HAL_I2C_MODULE_ENABLED
 #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_i2c.h>
#endif /* HAL_I2C_MODULE_ENABLED */

#ifdef HAL_I2S_MODULE_ENABLED
 #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_i2s.h>
#endif /* HAL_I2S_MODULE_ENABLED */

#ifdef HAL_IWDG_MODULE_ENABLED
 #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_iwdg.h>
#endif /* HAL_IWDG_MODULE_ENABLED */

#ifdef HAL_JPEG_MODULE_ENABLED
 #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_jpeg.h>
#endif /* HAL_JPEG_MODULE_ENABLED */

#ifdef HAL_MDIOS_MODULE_ENABLED
 #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_mdios.h>
#endif /* HAL_MDIOS_MODULE_ENABLED */

#ifdef HAL_MMC_MODULE_ENABLED
 #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_mmc.h>
#endif /* HAL_MMC_MODULE_ENABLED */

#ifdef HAL_LPTIM_MODULE_ENABLED
#include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_lptim.h>
#endif /* HAL_LPTIM_MODULE_ENABLED */

#ifdef HAL_LTDC_MODULE_ENABLED
#include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_ltdc.h>
#endif /* HAL_LTDC_MODULE_ENABLED */

#ifdef HAL_OPAMP_MODULE_ENABLED
#include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_opamp.h>
#endif /* HAL_OPAMP_MODULE_ENABLED */

#ifdef HAL_PWR_MODULE_ENABLED
 #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_pwr.h>
#endif /* HAL_PWR_MODULE_ENABLED */

#ifdef HAL_QSPI_MODULE_ENABLED
 #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_qspi.h>
#endif /* HAL_QSPI_MODULE_ENABLED */

#ifdef HAL_RAMECC_MODULE_ENABLED
 #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_ramecc.h>
#endif /* HAL_HCD_MODULE_ENABLED */

#ifdef HAL_RNG_MODULE_ENABLED
 #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_rng.h>
#endif /* HAL_RNG_MODULE_ENABLED */

#ifdef HAL_RTC_MODULE_ENABLED
 #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_rtc.h>
#endif /* HAL_RTC_MODULE_ENABLED */

#ifdef HAL_SAI_MODULE_ENABLED
 #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_sai.h>
#endif /* HAL_SAI_MODULE_ENABLED */

#ifdef HAL_SD_MODULE_ENABLED
 #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_sd.h>
#endif /* HAL_SD_MODULE_ENABLED */

#ifdef HAL_SDRAM_MODULE_ENABLED
 #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_sdram.h>
#endif /* HAL_SDRAM_MODULE_ENABLED */

#ifdef HAL_SPI_MODULE_ENABLED
 #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_spi.h>
#endif /* HAL_SPI_MODULE_ENABLED */

#ifdef HAL_SPDIFRX_MODULE_ENABLED
 #include <stm32h7/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_spdifrx.h>
#endif /* HAL_SPDIFRX_MODULE_ENABLED */

